[
    {
        "name": "Accenture",
        "summary": "Led the development of a Flutter project integrating InApp Messenger with Salesforce, enhanced React Native apps with Google Analytics 4, automated processes on Google Cloud Platform using Python, and modernized legacy systems with Node.js architecture.",
        "date": "02/2022 - 10/2024",
        "skills": [
            "Javascript",
            "ReactJS",
            "CSS",
            "Google Analytics",
            "Flutter",
            "Salesforce",
            "iOS",
            "Android",
            "Google Cloud Platform"
        ]
    },
    {
        "name": "MultTV",
        "summary": "Created multiplatform apps using Flutter for iOS, Android, and Set-Top Box devices, while also leveraging webOS and Tizen for SmartTV applications, enhancing user experience through innovative UI design and rigorous testing for top-notch quality.",
        "date": "08/2021 - 02/2022",
        "skills": [
            "Flutter",
            "Android"
        ]
    },
    {
        "name": "produtora.dev",
        "summary": "Redesigned in VueJS a methoreological company website with complex charts and designed a Flutter app for a video-based startup.",
        "date": "09/2020 - 07/2021",
        "skills": [
            "Flutter",
            "VueJS",
            "React Native"
        ]
    },
    {
        "name": "wepulse",
        "summary": "Created a health services web platform using ReactJS and Redux, applied agile methodologies for project management, optimized usability and performance, and ensured best practices in web development.",
        "date": "09/2019 - 02/2020",
        "skills": [
            "Javascript",
            "ReactJS",
            "Styled Components"
        ]
    },
    {
        "name": "Análise Editorial",
        "summary": "Developed website features with ReactJS and Redux, created custom carousels, utilized React Spring for animations, and ensured high performance and responsiveness across devices while collaborating with the team.",
        "date": "02/2019 - 09/2019",
        "skills": [
            "Javascript",
            "ReactJS",
            "CSS Modules",
            "React Motion"
        ]
    }
]